using UnityEngine;

namespace Uzil.Test {

public class Test_InvokerUpdate : MonoBehaviour {

	
	/*======================================Constructor==========================================*/

	/*=====================================Static Members========================================*/

	/*=====================================Static Funciton=======================================*/

	/*=========================================Members===========================================*/

	/*========================================Components=========================================*/

	/*==========================================Event============================================*/

	/*======================================Unity Function=======================================*/

	// Use this for initialization
	void Start () {
		
		// 主要Update中 加入 標籤有"testUpdate" 的 執行內容
		InvokerUpdate.main.Add(()=>{
			Debug.Log("per update");
		}).Tag("testUpdate");

		// 5秒後 取消 標籤有"testUpdate" 的 執行內容
		Invoker.main.Once(()=>{
			InvokerUpdate.main.Cancel("testUpdate");
			Debug.Log("cancel update");
		}, 5f);

	}
	
	// Update is called once per frame
	void Update () {
		
	}

	
	/*========================================Interface==========================================*/

	/*=====================================Public Function=======================================*/

	public void Test1 () {
		
		
	}

	/*===================================Protected Function======================================*/
	
	/*====================================Private Function=======================================*/
}


}
