
namespace Uzil.Proc {

public class ProcEvent_Template : ProcEvent {

	/*======================================Constructor==========================================*/

	/*=========================================Members===========================================*/

	// 要保存的變數盡量以string, int, float等基本型別 在 WriteToMemo, FromMemo中自行實作
	// 若有其他型別 則需 自行設計轉換為基本型別做保存

	/*========================================Components=========================================*/

	/*==========================================Event============================================*/

	/*======================================Unity Function=======================================*/

	/*========================================Interface==========================================*/

	/* 進入此事件的所屬節點時呼叫 */
	public override void Begin () {
		// 內容繼承後自定義
	}
	
	/* 結束此事件的所屬節點時呼叫 */
	public override void End () {
		// 內容繼承後自定義
	}

	/* 紀錄為Json格式 */
	protected override DictSO WriteToMemo () {
		DictSO data = base.WriteToMemo();
		// 內容繼承後自定義
		return data;
	}

	/* 讀取Json格式 */
	protected override void FromMemo (DictSO data) {
		base.FromMemo(data);
		// 內容繼承後自定義
		return;
	}

	/*=====================================Public Function=======================================*/
	
	/*===================================Protected Function======================================*/
	
	/*====================================Private Function=======================================*/


}

}