using System;

namespace Uzil.Res {


public class ResLoader {

	/*======================================Constructor==========================================*/

	/*=====================================Static Members========================================*/

	/*=====================================Static Funciton=======================================*/

	/*=========================================Members===========================================*/

	/*========================================Components=========================================*/
	
	/*==========================================Event============================================*/

	/*======================================Unity Function=======================================*/

	/*========================================Interface==========================================*/

	/*=====================================Public Function=======================================*/

	/** 預載資源 */
	// 回傳 bool 是否已經處理, ResResult 預載的資源資訊
	public virtual void Preload (ResReq req, Action<bool, ResResult> cb) {
		cb(/* 是否已經處理 */false, /* 預載的ResResult */null);
	}

	/* 卸載資源 */
	public virtual void Unload (ResInfo info) {
		
	}

	/* 取得資源 */
	public virtual ResResult Get (ResReq req) {
		return null;
	}

	/* 取得資源 非同步 */
	public virtual void GetAsync (ResReq req, Action<ResResult> cb) {
		cb(this.Get(req));
	}

	/*===================================Protected Function======================================*/
	
	/*====================================Private Function=======================================*/

}


}